pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fe4232.h
#define SD16GAIN_1             (0x0000)       /* SD16 Input Pre-Amplifier Gain Select *1  */
#define SD16GAIN_2             (0x0008)       /* SD16 Input Pre-Amplifier Gain Select *2  */
#define SD16GAIN_4             (0x0010)       /* SD16 Input Pre-Amplifier Gain Select *4  */
#define SD16GAIN_8             (0x0018)       /* SD16 Input Pre-Amplifier Gain Select *8  */
#define SD16GAIN_16            (0x0020)       /* SD16 Input Pre-Amplifier Gain Select *16 */
#define SD16GAIN_32            (0x0028)       /* SD16 Input Pre-Amplifier Gain Select *32 */

#define SD16INCH_0             (0x0000)       /* SD16 Input Channel select input */
#define SD16INCH_1             (0x0001)       /* SD16 Input Channel select input */
#define SD16INCH_2             (0x0002)       /* SD16 Input Channel select input */
#define SD16INCH_3             (0x0003)       /* SD16 Input Channel select input */
#define SD16INCH_4             (0x0004)       /* SD16 Input Channel select input */
#define SD16INCH_5             (0x0005)       /* SD16 Input Channel select input */
#define SD16INCH_6             (0x0006)       /* SD16 Input Channel select Temp */
#define SD16INCH_7             (0x0007)       /* SD16 Input Channel select Offset */

#define SD16INTDLY_0           (0x0000)       /* SD16 Interrupt Delay: Int. after 4.Conversion  */
#define SD16INTDLY_1           (0x0040)       /* SD16 Interrupt Delay: Int. after 3.Conversion  */
#define SD16INTDLY_2           (0x0080)       /* SD16 Interrupt Delay: Int. after 2.Conversion  */
#define SD16INTDLY_3           (0x00C0)       /* SD16 Interrupt Delay: Int. after 1.Conversion  */

/* SD16CTL - AFECTL */
#define SD16OVIE               (0x0002)       /* SD16 Overflow Interupt Enable */
#define SD16REFON              (0x0004)       /* SD16 Switch internal Reference on */
#define SD16VMIDON             (0x0008)       /* SD16 Switch Vmid Buffer on */
#define SD16SSEL0              (0x0010)       /* SD16 Clock Source Select 0 */
#define SD16SSEL1              (0x0020)       /* SD16 Clock Source Select 1 */
#define SD16DIV0               (0x0040)       /* SD16 Clock Divider Select 0 */
#define SD16DIV1               (0x0080)       /* SD16 Clock Divider Select 1 */
#define SD16LP                 (0x0100)       /* SD16 Low Power Mode Enable */

#define SD16DIV_0              (0x0000)       /* SD16 Clock Divider Select /1 */
#define SD16DIV_1              (SD16DIV0)     /* SD16 Clock Divider Select /2 */
#define SD16DIV_2              (SD16DIV1)     /* SD16 Clock Divider Select /4 */
#define SD16DIV_3            (SD16DIV0+SD16DIV1)    /* SD16 Clock Divider Select /8 */

#define SD16SSEL_0             (0x0000)       /* SD16 Clock Source Select MCLK  */
#define SD16SSEL_1             (SD16SSEL0)    /* SD16 Clock Source Select SMCLK */
#define SD16SSEL_2             (SD16SSEL1)    /* SD16 Clock Source Select ACLK  */
#define SD16SSEL_3           (SD16SSEL0+SD16SSEL1)  /* SD16 Clock Source Select TACLK */

/* SD16CCTLx - AFECCTLx */
#define SD16GRP                (0x0001)       /* SD16 Grouping of Channels: 0:Off/1:On */
#define SD16SC                 (0x0002)       /* SD16 Start Conversion */
#define SD16IFG                (0x0004)       /* SD16 Channel x Interrupt Flag */
#define SD16IE                 (0x0008)       /* SD16 Channel x Interrupt Enable */
#define SD16DF                 (0x0010)       /* SD16 Channel x Data Format: 0:Unipolar/1:Bipolar */
#define SD16OVIFG              (0x0020)       /* SD16 Channel x Overflow Interrupt Flag */
#define SD16LSBACC             (0x0040)       /* SD16 Channel x Access LSB of ADC */
#define SD16LSBTOG             (0x0080)       /* SD16 Channel x Toggle LSB Output of ADC */
#define SD16OSR0               (0x0100)       /* SD16 Channel x OverSampling Ratio 0 */
#define SD16OSR1               (0x0200)       /* SD16 Channel x OverSampling Ratio 1 */
#define SD16SNGL               (0x0400)       /* SD16 Channel x Single Conversion On/Off */

#define SD16OSR_256            (0x0000)       /* SD16 Channel x OverSampling Ratio 256 */
#define SD16OSR_128            (0x0100)       /* SD16 Channel x OverSampling Ratio 128 */
#define SD16OSR_64             (0x0200)       /* SD16 Channel x OverSampling Ratio  64 */
#define SD16OSR_32             (0x0300)       /* SD16 Channel x OverSampling Ratio  32 */

/* SD16IV Definitions */
#define SD16IV_NONE            (0x0000)       /* No Interrupt pending */
#define SD16IV_SD16OVIFG       (0x0002)       /* SD16OVIFG */
#define SD16IV_SD16MEM0        (0x0004)       /* SD16MEM0 SD16IFG */
#define SD16IV_SD16MEM1        (0x0006)       /* SD16MEM1 SD16IFG */

/************************************************************
* ESP430E
************************************************************/
#define __MSP430_HAS_ESP430E__                /* Definition to show that Module is available */

#define AFEINCTL0              SD16INCTL0     /* AFE Input Control Register Channel 0 */
#define AFEINCTL1              SD16INCTL1     /* AFE Input Control Register Channel 1 */
#define AFECTL                 SD16CTL        /* Analog Front End Control Register */
#define AFECCTL0               SD16CCTL0      /* AFE Channel 0 Control Register */
#define AFECCTL1               SD16CCTL1      /* AFE Channel 1 Control Register */

sfr_w(ESPCTL);                                /* ESP430 Control Register */
sfr_w(MBCTL);                                 /* Mailbox Control Register */
sfr_w(MBIN0);                                 /* Incoming Mailbox 0 Register */
sfr_w(MBIN1);                                 /* Incoming Mailbox 1 Register */
sfr_w(MBOUT0);                                /* Outgoing Mailbox 0 Register */
sfr_w(MBOUT1);                                /* Outgoing Mailbox 1 Register */

sfr_w(ESP430_STAT0);                          /* ESP430 Return Value 0 */
sfr_w(ESP430_STAT1);                          /* ESP430 Return Value 1 */
sfr_w(WAVEFSV1);                              /* ESP430 Return Value 2 */
sfr_w(RET3);                                  /* ESP430 Return Value 3 */
sfr_w(RET4);                                  /* ESP430 Return Value 4 */
sfr_w(WAVEFSI1);                              /* ESP430 Return Value 5 */
sfr_w(RET7);                                  /* ESP430 Return Value 7 */
sfr_w(ACTENERGY1_LO);                         /* ESP430 Return Value 8 */
sfr_w(ACTENERGY1_HI);                         /* ESP430 Return Value 9 */
sfr_w(REACTENERGY_LO);                        /* ESP430 Return Value 12 */
sfr_w(REACTENERGY_HI);                        /* ESP430 Return Value 13 */
sfr_w(APPENERGY_LO);                          /* ESP430 Return Value 14 */
sfr_w(APPENERGY_HI);                          /* ESP430 Return Value 15 */
sfr_w(ACTENSPER1_LO);                         /* ESP430 Return Value 16 */
sfr_w(ACTENSPER1_HI);                         /* ESP430 Return Value 17 */
sfr_w(IRMS_2_HI);                             /* ESP430 Return Value 18 */
sfr_w(IRMS_2_LO);                             /* ESP430 Return Value 19 */
sfr_w(POWERFCT);                              /* ESP430 Return Value 20 */
//const sfrw RESERVED         (0x01EA)  /* ESP430 Return Value 21 */
sfr_w(MAINSPERIOD);                           /* ESP430 Return Value 22 */
sfr_w(V1RMS);                                 /* ESP430 Return Value 23 */
sfr_w(IRMS_LO);                               /* ESP430 Return Value 24 */
sfr_w(IRMS_HI);                               /* ESP430 Return Value 25 */
sfr_w(VPEAK);                                 /* ESP430 Return Value 26 */
sfr_w(IPEAK);                                 /* ESP430 Return Value 27 */
sfr_w(LINECYCLCNT_LO);                        /* ESP430 Return Value 28 */
sfr_w(LINECYCLCNT_HI);                        /* ESP430 Return Value 29 */
sfr_w(NMBMEAS_LO);                            /* ESP430 Return Value 30 */
sfr_w(NMBMEAS_HI);                            /* ESP430 Return Value 31 */

#define RET0                   ESP430_STAT0   /* STATUS0 of ESP430 */
#define RET1                   ESP430_STAT1   /* STATUS1 of ESP430 */
#define RET2                   WAVEFSV1       /* Waveform Sample V1 offset corrected*/
#define RET5                   WAVEFSI1       /* Waveform Sample I1 offset corrected*/
//#define RET6          RESERVED       /* Reserved */
#define RET8                   ACTENERGY1_LO  /* Active energy I1 Low Word */
#define RET9                   ACTENERGY1_HI  /* Active energy I1 High Word */
//#define RET10          RESERVED       /* Reserved */
//#define RET11          RESERVED       /* Reserved */
#define RET12                  REACTENERGY_LO /* Reactive energy Low Word */
#define RET13                  REACTENERGY_HI /* Reactive energy High Word */
#define RET14                  APPENERGY_LO   /* Apparent energy Low Word */
#define RET15                  APPENERGY_HI   /* Apparent energy High Word */
#define RET16                  ACTENSPER1_LO  /* Active energy I1 for last mains period Low Word */
#define RET17                  ACTENSPER1_HI  /* Active energy I1 for last mains period High Word */
#define RET18                  IRMS_2_HI      /* Current RMS value last second I1 High Word */
#define RET19                  IRMS_2_LO      /* Current RMS value last second I1 Low Word */
#define RET20                  POWERFCT       /* Power factor */
//#define RET21          RESERVED       /* Reserved */
#define RET22                  MAINSPERIOD    /* Mains period */
#define RET23                  V1RMS          /* Voltage RMS V1 value last second */
#define RET24                  IRMS_LO        /* Current RMS value last second I1 Low Word */
#define RET25                  IRMS_HI        /* Current RMS value last second I1 High Word */
#define RET26                  VPEAK          /* Voltage V1 absolute peak value */
#define RET27                  IPEAK          /* Current absolute peak value I1 */
#define RET28                  LINECYCLCNT_LO /* Line cycle counter Low Word */
#define RET29                  LINECYCLCNT_HI /* Line cycle counter High Word */
#define RET30                  NMBMEAS_LO     /* Number of Measurements for CPU signal Low Word */
#define RET31                  NMBMEAS_HI     /* Number of Measurements for CPU signal High Word */

/* ESPCTL */
#define ESPEN                  (0x0001)       /* ESP430 Module enable */
#define ESPSUSP                (0x0002)       /* ESP430 Module suspend */
#define IREQ                   (0x0004)       /* NOT supported by current ESP430 Software */

/* RET0 - Status0 Flags */
#define WFSRDYFG               (0x0001)       /* New waveform Samples ready Flag */
//#define RESERVED          (0x0002)  /* Reserved */
#define ILREACHEDFG            (0x0004)       /* Interrupt level reached Flag */
#define ENRDYFG                (0x0008)       /* New Energy values ready Flag */
#define ZXLDFG                 (0x0010)       /* Zero Crossing of V1 Flag (leading edge) */
#define ZXTRFG                 (0x0020)       /* Zero Crossing of V1 Flag (trailing edge) */
#define CALRDYFG               (0x0040)       /* Calibration values ready Flag */
#define TAMPFG                 (0x0080)       /* Tampering Occured Flag */
#define NEGENFG                (0x0100)       /* Negativ Energy Flag */
#define VDROPFG                (0x0200)       /* Voltage drop occured Flag */
#define VPEAKFG                (0x0400)       /* Voltage exceed VPeak level Flag */
#define I1PEAKFG               (0x0800)       /* Current exceed I1Peak level Flag */
//#define RESERVED          (0x1000)  /* Reserved */
//#define RESERVED          (0x2000)  /* Reserved */
//#define RESERVED          (0x4000)  /* Reserved */
#define ACTIVEFG               (0x8000)       /* Measurement or Calibration running Flag */

/* RET1 - Status1 Flags */
#define ILNEGFG                (0x0004)       /* Negative Interrupt level reached Flag */
#define VPEAKNEGFG             (0x0400)       /* Negative Voltage exceed VPeak level Flag */
#define I1PEAKNEGFG            (0x0800)       /* Negative Current exceed I1Peak level Flag */

/* MBCTL */
#define IN0IFG                 (0x0001)       /* Incoming Mail 0 Interrupt Flag */
#define IN1IFG                 (0x0002)       /* Incoming Mail 1 Interrupt Flag */
#define OUT0FG                 (0x0004)       /* Outgoing Mail 0 Flag */
#define OUT1FG                 (0x0008)       /* Outgoing Mail 1 Flag */
#define IN0IE                  (0x0010)       /* Incoming Mail 0 Interrupt Enable */
#define IN1IE                  (0x0020)       /* Incoming Mail 1 Interrupt Enable */
#define CLR0OFF                (0x0040)       /* Switch off automatic clear of IN0IFG */
#define CLR1OFF                (0x0080)       /* Switch off automatic clear of IN1IFG */
#define OUT0IFG                (0x0100)       /* Outgoing Mail 0 Interrupt Flag */
#define OUT1IFG                (0x0200)       /* Outgoing Mail 1 Interrupt Flag */
#define OUT0IE                 (0x0400)       /* Outgoing Mail 0 Interrupt Enable */
#define OUT1IE                 (0x0800)       /* Outgoing Mail 1 Interrupt Enable */

/* Messages to ESP */
#define mRESET                 (0x0001)       /* Restart ESP430 Software */
#define mSET_MODE              (0x0003)       /* Set Operation Mode for ESP430 Software */
#define mCLR_EVENT             (0x0005)       /* Clear Flags for ESP430 Software */
#define mINIT                  (0x0007)       /* Initialize ESP430 Software */
#define mTEMP                  (0x0009)       /* Request Temp. Measurement from ESP430 Software */
#define mSWVERSION             (0x000B)       /* Request software version of ESP430 */
#define mREAD_PARAM            (0x000D)       /* Request to read the parameter with no. “Parameter No.” */

#define mSET_CTRL0             (0x0200)       /* Set Control Register 0 */
#define mSET_CTRL1             (0x0202)       /* Set Control Register 1 */
#define mSET_EVENT             (0x0204)       /* Set which Evenets should cause an message */
#define mSET_PHASECORR1        (0x0206)       /* Set Phase Correction fo I1 */
#define mSET_V1OFFSET          (0x020A)       /* Set Offset for V1 */
#define mSET_I1OFFSET          (0x020C)       /* Set Offset for I1 */
#define mSET_ADAPTI1           (0x0210)       /* Set Adaption factor for I1 */
#define mSET_GAINCORR1         (0x0214)       /* Set Gain Correction for Power P1 */
#define mSET_POFFSET1_LO       (0x0216)       /* Set Power Offset for Power P1 */
#define mSET_POFFSET1_HI       (0x0218)       /* Set Power Offset for Power P1 */
#define mSET_INTRPTLEVL_LO     (0x0220)       /* Set Interrupt Level */
#define mSET_INTRPTLEVL_HI     (0x0222)       /* Set Interrupt Level */
#define mSET_CALCYCLCNT        (0x0224)       /* Set number of main cycles for calibration */
#define mSET_STARTCURR_FRAC    (0x0226)       /* Set start current fractional Part*/
#define mSET_STARTCURR_INT     (0x0228)       /* Set start current integer Part*/
#define mSET_NOMFREQ           (0x022A)       /* Set nominal main frequency */
#define mSET_VDROPCYCLS        (0x022C)       /* Set cylces for VDrop detection */
#define mSET_RATIOTAMP         (0x022E)       /* Set ratio for tamper detection */
#define mSET_ITAMP             (0x0230)       /* Set minimum current for tamper detection */
#define mSET_VDROPLEVEL        (0x0232)       /* Set level for VDrop detection */
#define mSET_VPEAKLEVEL        (0x0234)       /* Set level for VPeak detection */
#define mSET_IPEAKLEVEL        (0x0236)       /* Set level for IPeak detection */
#define mSET_DCREMPER          (0x0238)       /* Set number of periods for DC-removal */

#define mSET_DELTAV1MAX        (0x023A)       /* Set max. change of V1 if V1FILTER =1  */
#define mSET_CORRCOMP          (0x023C)       /* Set Common Mode Rejection ratio */
#define mSET_FADCU             (0x023E)       /* Set ADC sampling frequency fADC */

/* Flags for mSET_CTRL0 */
#define CURR_I1                (0x0002)       /* 0: Current transformer, dc-tol CT or shunt */
                                      /* 1: Rogowski coil (not yet implemented) */
#define MB                     (0x0004)       /* Intrpt to CPU: 0: energy level  1: #measurements */
#define NE0                    (0x0008)       /* Neg. energy treatment:      00: clear neg. energy */
#define NE1                    (0x0010)       /* 01: use absolute energy   10: use energy as it is */
#define DCREM_V1               (0x0020)       /* DC removal for V1:  0: off  1: on */
#define DCREM_I1               (0x0040)       /* DC removal for I1:  0: off  1: on */
#define V1FILTER               (0x0100)       /* Enable on V1 Spike Filter:  0: off  1: on */

